freelinux-zs/MNX005_3G/nRF5_SDK_12.3.0_d7731ad/nRF5_SDK_12.3.0_d7731ad/examples/ble_peripheral/ble_app_template/main.c
    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();

    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(BLE_ADV_MODE_FAST);

    APP_ERROR_CHECK(err_code);
}

void repeat(CallBackFun function, uint8_t *para)
{
		function(para);
}

uint8_t* get_uart_data(uint8_t* a)
{		
		NRF_LOG_INFO("%s\r\n",(uint32_t )a);	
		return a;
}


static void uart_event_handle(app_uart_evt_t * p_event)
{
	static uint8_t data_array[256];
	static uint8_t index = 0;
	static uint8_t p_data[256] = {0};
	
	switch (p_event->evt_type)
    {		
        case APP_UART_DATA_READY:	
					UNUSED_VARIABLE(app_uart_get(&data_array[index]));
					index++;					
					if ((data_array[index - 1] == '\n') || (index >= 255))
					{			
						memcpy(p_data,data_array,sizeof(data_array));
						repeat(get_uart_data,p_data);
						memset(data_array, 0, sizeof(data_array));
						index = 0;				
					}
          break;

        case APP_UART_COMMUNICATION_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_communication);
            break;

        case APP_UART_FIFO_ERROR:
            APP_ERROR_HANDLER(p_event->data.error_code);
            break;

        default:
            break;
    }
}


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init_gps(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER_GPS,
        TX_PIN_NUMBER_GPS,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud9600  //UART_BAUDRATE_BAUDRATE_Baud115200 UART_BAUDRATE_BAUDRATE_Baud9600
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

static void uart_init_3g(void)
{
    uint32_t                     err_code;
    const app_uart_comm_params_t comm_params =
    {
        RX_PIN_NUMBER_3G,
        TX_PIN_NUMBER_3G,
        RTS_PIN_NUMBER,
        CTS_PIN_NUMBER,
        APP_UART_FLOW_CONTROL_DISABLED,
        false,
        UART_BAUDRATE_BAUDRATE_Baud115200  //UART_BAUDRATE_BAUDRATE_Baud115200 UART_BAUDRATE_BAUDRATE_Baud9600
    };

    APP_UART_FIFO_INIT( &comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}

void gpio_init(void)
{
	nrf_gpio_cfg_output(MOTOR_PIN1);
	nrf_gpio_cfg_output(MOTOR_PIN2);
	nrf_gpio_cfg_output(GPS_PIN);
	nrf_gpio_cfg_output(BUZZ_PIN);
	nrf_gpio_cfg_output(BB_EN_PIN);
	nrf_gpio_pin_write(MOTOR_PIN1, 0);
	nrf_gpio_pin_write(MOTOR_PIN2, 0);
	nrf_gpio_pin_write(GPS_PIN, 0);
	nrf_gpio_pin_write(BUZZ_PIN, 0);
	nrf_gpio_pin_write(BB_EN_PIN, 1);

}


/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool     erase_bonds;

    // Initialize.
    err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
    timers_init();
		//uart_init();
		gpio_init();
    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    peer_manager_init(erase_bonds);
    if (erase_bonds == true)
    {
        NRF_LOG_INFO("Bonds erased!\r\n");
    }
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("MXN005 started\r\n");
    application_timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        if (NRF_LOG_PROCESS() == false)
        {
            power_manage();
        }
    }
}


/**
 * @}
 */
